---
type: ExternalResourceLoadContext
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ExternalResourceLoadContext

`Autodesk.Revit.DB.ExternalResourceLoadContext` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CallingDocumentHasModelPath | 2015 | `public bool CallingDocumentHasModelPath ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCallingDocumentModelPath | 2015 | `public ModelPath GetCallingDocumentModelPath ()` |
| Method | GetCurrentlyLoadedReference | 2015 | `public ExternalResourceReference GetCurrentlyLoadedReference ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LoadOperationType | 2015 | `public LoadOperationType LoadOperationType { get ; }` |